betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_spi.h
/** @defgroup SPI_BaudRate_Prescaler SPI BaudRate Prescaler
  * @{
  */
#define SPI_BAUDRATEPRESCALER_2         (0x00000000U)
#define SPI_BAUDRATEPRESCALER_4         (SPI_CTRL1_BRSEL_0)
#define SPI_BAUDRATEPRESCALER_8         (SPI_CTRL1_BRSEL_1)
#define SPI_BAUDRATEPRESCALER_16        (SPI_CTRL1_BRSEL_1 | SPI_CTRL1_BRSEL_0)
#define SPI_BAUDRATEPRESCALER_32        (SPI_CTRL1_BRSEL_2)
#define SPI_BAUDRATEPRESCALER_64        (SPI_CTRL1_BRSEL_2 | SPI_CTRL1_BRSEL_0)
#define SPI_BAUDRATEPRESCALER_128       (SPI_CTRL1_BRSEL_2 | SPI_CTRL1_BRSEL_1)
#define SPI_BAUDRATEPRESCALER_256       (SPI_CTRL1_BRSEL_2 | SPI_CTRL1_BRSEL_1 | SPI_CTRL1_BRSEL_0)
/**
  * @}
  */

/** @defgroup SPI_MSB_LSB_transmission SPI MSB LSB Transmission
  * @{
  */
#define SPI_FIRSTBIT_MSB                (0x00000000U)
#define SPI_FIRSTBIT_LSB                SPI_CTRL1_LSBSEL
/**
  * @}
  */

/** @defgroup SPI_TI_mode SPI TI Mode
  * @{
  */
#define SPI_TIMODE_DISABLE              (0x00000000U)
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define SPI_TIMODE_ENABLE               SPI_CTRL2_FRFCFG
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

/** @defgroup SPI_CRC_Calculation SPI CRC Calculation
  * @{
  */
#define SPI_CRCCALCULATION_DISABLE      (0x00000000U)
#define SPI_CRCCALCULATION_ENABLE       SPI_CTRL1_CRCEN
/**
  * @}
  */

/** @defgroup SPI_Interrupt_definition SPI Interrupt Definition
  * @{
  */
#define SPI_IT_TXE                      SPI_CTRL2_TXBEIEN
#define SPI_IT_RXNE                     SPI_CTRL2_RXBNEIEN
#define SPI_IT_ERR                      SPI_CTRL2_ERRIEN
/**
  * @}
  */

/** @defgroup SPI_Flags_definition SPI Flags Definition
  * @{
  */
#define SPI_FLAG_RXNE                   SPI_STS_RXBNEFLG   /* SPI status flag: Rx buffer not empty flag       */
#define SPI_FLAG_TXE                    SPI_STS_TXBEFLG    /* SPI status flag: Tx buffer empty flag           */
#define SPI_FLAG_BSY                    SPI_STS_BSYFLG     /* SPI status flag: Busy flag                      */
#define SPI_FLAG_CRCERR                 SPI_STS_CRCEFLG    /* SPI Error flag: CRC error flag                  */
#define SPI_FLAG_MODF                   SPI_STS_MEFLG      /* SPI Error flag: Mode fault flag                 */
#define SPI_FLAG_OVR                    SPI_STS_OVRFLG     /* SPI Error flag: Overrun flag                    */
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define SPI_FLAG_FRE                    SPI_STS_FFERR      /* SPI Error flag: TI mode frame format error flag */
#define SPI_FLAG_MASK                   (SPI_STS_RXBNEFLG | SPI_STS_TXBEFLG | SPI_STS_BSYFLG | SPI_STS_CRCEFLG\
                                         | SPI_STS_MEFLG | SPI_STS_OVRFLG | SPI_STS_FFERR)
#else
#define SPI_FLAG_MASK                   (SPI_STS_RXBNEFLG | SPI_STS_TXBEFLG | SPI_STS_BSYFLG | SPI_STS_CRCEFLG\
                                         | SPI_STS_MEFLG | SPI_STS_OVRFLG)
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup SPI_Exported_Macros SPI Exported Macros
  * @{
  */

/** @brief  Reset SPI handle state.
  * @param  __HANDLE__ specifies the SPI Handle.
  *         This parameter can be SPI where x: 1, 2, or 3 to select the SPI peripheral.
  * @retval None
  */
#if (USE_DAL_SPI_REGISTER_CALLBACKS == 1U)
#define __DAL_SPI_RESET_HANDLE_STATE(__HANDLE__)                do{                                                  \
                                                                    (__HANDLE__)->State = DAL_SPI_STATE_RESET;       \
                                                                    (__HANDLE__)->MspInitCallback = NULL;            \
                                                                    (__HANDLE__)->MspDeInitCallback = NULL;          \
                                                                  } while(0)
#else
#define __DAL_SPI_RESET_HANDLE_STATE(__HANDLE__) ((__HANDLE__)->State = DAL_SPI_STATE_RESET)
#endif /* USE_DAL_SPI_REGISTER_CALLBACKS */

/** @brief  Enable the specified SPI interrupts.
  * @param  __HANDLE__ specifies the SPI Handle.
  *         This parameter can be SPI where x: 1, 2, or 3 to select the SPI peripheral.
  * @param  __INTERRUPT__ specifies the interrupt source to enable.
  *         This parameter can be one of the following values:
  *            @arg SPI_IT_TXE: Tx buffer empty interrupt enable
  *            @arg SPI_IT_RXNE: RX buffer not empty interrupt enable
  *            @arg SPI_IT_ERR: Error interrupt enable
  * @retval None
  */
#define __DAL_SPI_ENABLE_IT(__HANDLE__, __INTERRUPT__)   SET_BIT((__HANDLE__)->Instance->CTRL2, (__INTERRUPT__))

/** @brief  Disable the specified SPI interrupts.
  * @param  __HANDLE__ specifies the SPI handle.
  *         This parameter can be SPIx where x: 1, 2, or 3 to select the SPI peripheral.
  * @param  __INTERRUPT__ specifies the interrupt source to disable.
  *         This parameter can be one of the following values:
  *            @arg SPI_IT_TXE: Tx buffer empty interrupt enable
  *            @arg SPI_IT_RXNE: RX buffer not empty interrupt enable
  *            @arg SPI_IT_ERR: Error interrupt enable
  * @retval None
  */
#define __DAL_SPI_DISABLE_IT(__HANDLE__, __INTERRUPT__)  CLEAR_BIT((__HANDLE__)->Instance->CTRL2, (__INTERRUPT__))

/** @brief  Check whether the specified SPI interrupt source is enabled or not.
  * @param  __HANDLE__ specifies the SPI Handle.
  *         This parameter can be SPI where x: 1, 2, or 3 to select the SPI peripheral.
  * @param  __INTERRUPT__ specifies the SPI interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg SPI_IT_TXE: Tx buffer empty interrupt enable
  *            @arg SPI_IT_RXNE: RX buffer not empty interrupt enable
  *            @arg SPI_IT_ERR: Error interrupt enable
  * @retval The new state of __IT__ (TRUE or FALSE).
  */
#define __DAL_SPI_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) ((((__HANDLE__)->Instance->CTRL2\
                                                              & (__INTERRUPT__)) == (__INTERRUPT__)) ? SET : RESET)

